; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v5)
             (pred_8 ?v1 ?v2)
             (pred_1 ?v11 ?v2)
             (pred_10 ?v7 ?v11 )
	     (pred_3 ?v11)
             (pred_5 ?v6)
             (pred_6 ?v1)
             (pred_11 ?v2)
             (pred_2 ?v11)
             (pred_9 ?v1)
             (pred_12 ?v11)
             (pred_4 ))



(:action op_3
:parameters (?v13 ?v3 ?v9 ?v10)
:precondition (and (pred_5 ?v13) (pred_5 ?v3) (pred_6 ?v9) (pred_11 ?v10)
          (pred_7 ?v13 ?v3) (pred_8 ?v9 ?v10)
                   (pred_1 ?v3 ?v10) (pred_3 ?v13) 
                   (pred_2 ?v3) (pred_9 ?v9))
:effect (and  (pred_12 ?v3) (not (pred_2 ?v3))))


(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_5 ?v13) (pred_5 ?v4)
               (pred_3 ?v13) (pred_7 ?v13 ?v4) (pred_12 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v13))))

(:action op_2
:parameters (?v13 ?v9)
:precondition (and (pred_5 ?v13) (pred_6 ?v9) 
                  (pred_3 ?v13) (pred_10 ?v9 ?v13) (pred_4 ))
:effect (and (pred_9 ?v9)
   (not (pred_10 ?v9 ?v13)) (not (pred_4 ))))


(:action op_4
:parameters (?v13 ?v12 ?v8)
:precondition (and (pred_5 ?v13) (pred_6 ?v12) (pred_6 ?v8)
                  (pred_3 ?v13) (pred_9 ?v8) (pred_10 ?v12 ?v13))
:effect (and (pred_9 ?v12) (pred_10 ?v8 ?v13)
        (not (pred_9 ?v8)) (not (pred_10 ?v12 ?v13))))

(:action op_1
:parameters (?v13 ?v9)
:precondition (and (pred_5 ?v13) (pred_6 ?v9) 
                  (pred_3 ?v13) (pred_9 ?v9))
:effect (and (pred_4 ) (pred_10 ?v9 ?v13) (not (pred_9 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_13 obj_02 obj_07 obj_19 obj_05 obj_08 obj_09 obj_16 obj_10 obj_21 obj_15 obj_11 obj_12 obj_17 obj_14
    obj_06 obj_04
    obj_20 obj_01 obj_18
    )

    (:init
       (pred_4)

       (pred_5 obj_03)
       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_07)
       (pred_5 obj_19)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_17)
       (pred_5 obj_14)
       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_18)

       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_13)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_03)
       (pred_7 obj_02 obj_08)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_19 obj_05)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_19)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_08 obj_02)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_10 obj_05)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_17 obj_14)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_1  obj_05 obj_06)
       (pred_1  obj_17 obj_04)
       (pred_1  obj_09 obj_04)
       (pred_12 obj_03)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_10)
       (pred_12 obj_21)
       (pred_12 obj_15)
       (pred_12 obj_11)
       (pred_12 obj_12)
       (pred_12 obj_14)

       (pred_8  obj_20 obj_06)
       (pred_8  obj_01 obj_04)
       (pred_8  obj_18 obj_04)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_18 obj_07)
       (pred_3 obj_03)
    )

    (:goal (and
       (pred_10 obj_20 obj_19)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_5 obj_03 obj_19)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_19)
   goals met: 0 of 1
2. (op_5 obj_19 obj_16)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_16)
   goals met: 0 of 1
3. (op_5 obj_16 obj_10)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_21)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_21)
   goals met: 0 of 1
5. (op_5 obj_21 obj_08)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_08)
   goals met: 0 of 1
6. (op_5 obj_08 obj_02)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_02)
   goals met: 0 of 1
7. (op_2 obj_02 obj_20)
   deleted: (pred_10 obj_20 obj_02) (pred_4)
   added: (pred_9 obj_20)
   goals met: 0 of 1
8. (op_5 obj_02 obj_08)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_08)
   goals met: 0 of 1
9. (op_3 obj_08 obj_05 obj_20 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_12 obj_05)
   goals met: 0 of 1
10. (op_5 obj_08 obj_05)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_05)
   goals met: 0 of 1
11. (op_5 obj_05 obj_19)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_19)
   goals met: 0 of 1
12. (op_1 obj_19 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_4) (pred_10 obj_20 obj_19)
   goals met: 1 of 1
